zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf9160.svd
<?xml version="1.0" encoding="utf-8"?>
<!-- File naming: <vendor>_<part/series name>_svd.xml -->
<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>Nordic Semiconductor</vendor>
  <vendorID>Nordic</vendorID>
  <name>nrf9160</name>
  <series>nrf91</series>
  <version>1</version>
  <description>nrf9160 reference description for radio MCU with ARM 32-bit Cortex-M33 Microcontroller </description>
  <licenseText>
Copyright (c) 2010 - 2018, Nordic Semiconductor ASA All rights reserved.\n
\n
Redistribution and use in source and binary forms, with or without\n
modification, are permitted provided that the following conditions are met:\n
\n
1. Redistributions of source code must retain the above copyright notice, this\n
   list of conditions and the following disclaimer.\n
\n
2. Redistributions in binary form must reproduce the above copyright\n
   notice, this list of conditions and the following disclaimer in the\n
   documentation and/or other materials provided with the distribution.\n
\n
3. Neither the name of Nordic Semiconductor ASA nor the names of its\n
   contributors may be used to endorse or promote products derived from this\n
   software without specific prior written permission.\n
\n
THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"\n
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE\n
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE\n
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF\n
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)\n
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n
POSSIBILITY OF SUCH DAMAGE.\n
        </licenseText>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <size>32</size>
  <resetValue>0x00000000</resetValue>
  <resetMask>0xFFFFFFFF</resetMask>
  <cpu>
    <name>CM33</name>
    <revision>r0p4</revision>
    <endian>little</endian>
    <mpuPresent>1</mpuPresent>
    <fpuPresent>1</fpuPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>0</vendorSystickConfig>
    <deviceNumInterrupts>69</deviceNumInterrupts>
    <sauNumRegions>0</sauNumRegions>
  </cpu>
  <headerSystemFilename>system_nrf9160</headerSystemFilename>
  <headerDefinitionsPrefix>NRF_</headerDefinitionsPrefix>
  <vendorExtensions>
    <MaxInterrupts>240</MaxInterrupts>
  </vendorExtensions>
  <peripherals>
    <peripheral>
      <name>FICR_S</name>
      <description>Factory Information Configuration Registers</description>
      <baseAddress>0x00FF0000</baseAddress>
      <headerStructName>FICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>FICR</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <name>INFO</name>
          <description>Device info</description>
          <headerStructName>FICR_INFO</headerStructName>
          <access>read-write</access>
          <addressOffset>0x200</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DEVICEID[%s]</name>
            <description>Description collection: Device identifier</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICEID</name>
                <description>64 bit unique device identifier</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PART</name>
            <description>Part code</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00009160</resetValue>
            <fields>
              <field>
                <name>PART</name>
                <description>Part code</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>N9160</name>
                    <description>nRF9160</description>
                    <value>0x9160</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>VARIANT</name>
            <description>Part Variant, Hardware version and Production configuration</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x0FFFFFFF</resetValue>
            <fields>
              <field>
                <name>VARIANT</name>
                <description>Part Variant, Hardware version and Production configuration, encoded as ASCII</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AAAA</name>
                    <description>AAAA</description>
                    <value>0x41414141</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AAA0</name>
                    <description>AAA0</description>
                    <value>0x41414130</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKAGE</name>
            <description>Package option</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00002000</resetValue>
            <fields>
              <field>
                <name>PACKAGE</name>
                <description>Package option</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CC</name>
                    <description>CCxx - 236 ball wlCSP</description>
                    <value>0x2000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RAM</name>
            <description>RAM variant</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000100</resetValue>
            <fields>
              <field>
                <name>RAM</name>
                <description>RAM variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K256</name>
                    <description>256  kByte RAM</description>
                    <value>0x100</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unspecified</name>
                    <description>Unspecified</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FLASH</name>
            <description>Flash variant</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000400</resetValue>
            <fields>
              <field>
                <name>FLASH</name>
                <description>Flash variant</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>K1024</name>
                    <description>1 MByte FLASH</description>
                    <value>0x400</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CODEPAGESIZE</name>
            <description>Code memory page size</description>
            <addressOffset>0x020</addressOffset>
            <access>read-only</access>
            <resetValue>0x00001000</resetValue>
            <fields>
              <field>
                <name>CODEPAGESIZE</name>
                <description>Code memory page size</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CODESIZE</name>
            <description>Code memory size</description>
            <addressOffset>0x024</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000100</resetValue>
            <fields>
              <field>
                <name>CODESIZE</name>
                <description>Code memory size in number of pages</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DEVICETYPE</name>
            <description>Device type</description>
            <addressOffset>0x028</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>DEVICETYPE</name>
                <description>Device type</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Die</name>
                    <description>Device is an physical DIE</description>
                    <value>0x0000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FPGA</name>
                    <description>Device is an FPGA</description>
                    <value>0xFFFFFFFF</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>256</dim>
          <dimIncrement>0x008</dimIncrement>
          <name>TRIMCNF[%s]</name>
          <description>Unspecified</description>
          <headerStructName>FICR_TRIMCNF</headerStructName>
          <access>read-write</access>
          <addressOffset>0x300</addressOffset>
          <register>
            <name>ADDR</name>
            <description>Description cluster: Address</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>Address</name>
                <description>Address</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA</name>
            <description>Description cluster: Data</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>Data</name>
                <description>Data</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TRNG90B</name>
          <description>NIST800-90B RNG calibration data</description>
          <headerStructName>FICR_TRNG90B</headerStructName>
          <access>read-write</access>
          <addressOffset>0xC00</addressOffset>
          <register>
            <name>BYTES</name>
            <description>Amount of bytes for the required entropy bits</description>
            <addressOffset>0x000</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>BYTES</name>
                <description>Amount of bytes for the required entropy bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCCUTOFF</name>
            <description>Repetition counter cutoff</description>
            <addressOffset>0x004</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>RCCUTOFF</name>
                <description>Repetition counter cutoff</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>APCUTOFF</name>
            <description>Adaptive proportion cutoff</description>
            <addressOffset>0x008</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>APCUTOFF</name>
                <description>Adaptive proportion cutoff</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTUP</name>
            <description>Amount of bytes for the startup tests</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000210</resetValue>
            <fields>
              <field>
                <name>STARTUP</name>
                <description>Amount of bytes for the startup tests</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC1</name>
            <description>Sample count for ring oscillator 1</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC1</name>
                <description>Sample count for ring oscillator 1</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC2</name>
            <description>Sample count for ring oscillator 2</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC2</name>
                <description>Sample count for ring oscillator 2</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC3</name>
            <description>Sample count for ring oscillator 3</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC3</name>
                <description>Sample count for ring oscillator 3</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ROSC4</name>
            <description>Sample count for ring oscillator 4</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>ROSC4</name>
                <description>Sample count for ring oscillator 4</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
