zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf9160.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>UICR_S</name>
      <description>User information configuration registers User information configuration registers</description>
      <baseAddress>0x00FF8000</baseAddress>
      <headerStructName>UICR</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>UICR</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>APPROTECT</name>
          <description>Access port protection</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all CPU registers and
          memory mapped addresses</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>XOSC32M</name>
          <description>Oscillator control</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFCF</resetValue>
          <fields>
            <field>
              <name>CTRL</name>
              <description>Pierce current DAC control signals</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOSRC</name>
          <description>HFXO clock source selection</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>HFXOSRC</name>
              <description>HFXO clock source selection</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTAL</name>
                  <description>32 MHz crystal oscillator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCXO</name>
                  <description>32 MHz temperature compensated crystal oscillator (TCXO)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HFXOCNT</name>
          <description>HFXO startup counter</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>HFXOCNT</name>
              <description>HFXO startup counter. Total debounce time = HFXOCNT*64 us + 0.5 us</description>
              <lsb>0</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MinDebounceTime</name>
                  <description>Min debounce time = (0*64 us + 0.5 us)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MaxDebounceTime</name>
                  <description>Max debounce time = (255*64 us + 0.5 us)</description>
                  <value>255</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SECUREAPPROTECT</name>
          <description>Secure access port protection</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks debugger read/write access to all secure CPU registers and secure
          memory mapped addresses</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPROTECT</name>
          <description>Erase protection</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PALL</name>
              <description>Blocks NVMC ERASEALL and CTRLAP ERASEALL functionality</description>
              <lsb>0</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unprotected</name>
                  <description>Unprotected</description>
                  <value>0xFFFFFFFF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Protected</name>
                  <description>Protected</description>
                  <value>0x00000000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0xBE</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>OTP[%s]</name>
          <description>Description collection: OTP bits [31+n*32:0+n*32].</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>OTP</name>
              <description>Bits [31+n*32:0+n*32] of OTP region</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>KEYSLOT</name>
          <description>Unspecified</description>
          <headerStructName>UICR_KEYSLOT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x008</dimIncrement>
            <name>CONFIG[%s]</name>
            <description>Unspecified</description>
            <headerStructName>UICR_KEYSLOT_CONFIG</headerStructName>
            <access>read-write</access>
            <addressOffset>0x000</addressOffset>
            <register>
              <name>DEST</name>
              <description>Description cluster: Destination address where content of the key value registers (KEYSLOT.KEYn.VALUE[0-3])
          will be pushed by KMU. Note that this address MUST match that of a peripherals
          APB mapped write-only key registers, else the KMU can push this key value into
          an address range which the CPU can potentially read!</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>DEST</name>
                  <description>Secure APB destination address</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>PERM</name>
              <description>Description cluster: Define permissions for the key slot with ID=n+1. Bits 0-15 and 16-31 can only be written once.</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>WRITE</name>
                  <description>Write permission for key slot</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable write to the key value registers</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable write to the key value registers</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>READ</name>
                  <description>Read permission for key slot</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable read from key value registers</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable read from key value registers</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>PUSH</name>
                  <description>Push permission for key slot</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disabled</name>
                      <description>Disable pushing of key value registers over secure APB, but can be read if field READ is Enabled</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Enabled</name>
                      <description>Enable pushing of key value registers over secure APB. Register KEYSLOT.CONFIGn.DEST must contain a valid destination address!</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>STATE</name>
                  <description>Revocation state for the key slot</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Revoked</name>
                      <description>Key value registers can no longer be read or pushed</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Active</name>
                      <description>Key value registers are readable (if enabled) and can be pushed (if enabled)</description>
                      <value>1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <dim>128</dim>
            <dimIncrement>0x010</dimIncrement>
            <name>KEY[%s]</name>
            <description>Unspecified</description>
            <headerStructName>UICR_KEYSLOT_KEY</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <register>
              <dim>0x4</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>VALUE[%s]</name>
              <description>Description collection: Define bits [31+o*32:0+o*32] of value assigned to KMU key slot ID=n+1</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <fields>
                <field>
                  <name>VALUE</name>
                  <description>Define bits [31+o*32:0+o*32] of value assigned to KMU key slot ID=n+1</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
