zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf9160.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>REGULATORS_NS</name>
      <description>Voltage regulators control 0</description>
      <baseAddress>0x40004000</baseAddress>
      <headerStructName>REGULATORS</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>REGULATORS</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>SYSTEMOFF</name>
          <description>System OFF register</description>
          <addressOffset>0x500</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>SYSTEMOFF</name>
              <description>Enable System OFF mode</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable System OFF mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>POFCON</name>
          <description>Power-fail comparator configuration</description>
          <addressOffset>0x510</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <fields>
            <field>
              <name>POF</name>
              <description>Enable or disable power-fail comparator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>THRESHOLD</name>
              <description>Power-fail comparator threshold setting</description>
              <lsb>1</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V19</name>
                  <description>Set threshold to 1.9 V</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V20</name>
                  <description>Set threshold to 2.0 V</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V21</name>
                  <description>Set threshold to 2.1 V</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V22</name>
                  <description>Set threshold to 2.2 V</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V23</name>
                  <description>Set threshold to 2.3 V</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V24</name>
                  <description>Set threshold to 2.4 V</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V25</name>
                  <description>Set threshold to 2.5 V</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V26</name>
                  <description>Set threshold to 2.6 V</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V27</name>
                  <description>Set threshold to 2.7 V</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V28</name>
                  <description>Set threshold to 2.8 V</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCDCEN</name>
          <description>Enable DC/DC mode of the main voltage regulator</description>
          <addressOffset>0x578</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>DCDCEN</name>
              <description>Enable DC/DC converter</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>DC/DC mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>DC/DC mode is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="REGULATORS_NS">
      <name>REGULATORS_S</name>
      <description>Voltage regulators control 1</description>
      <baseAddress>0x50004000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
    </peripheral>
    <peripheral>
      <name>CLOCK_NS</name>
      <description>Clock management 0</description>
      <baseAddress>0x40005000</baseAddress>
      <headerStructName>CLOCK</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CLOCK_POWER</name>
        <value>5</value>
      </interrupt>
      <groupName>CLOCK</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>TASKS_HFCLKSTART</name>
          <description>Start HFCLK crystal oscillator</description>
          <addressOffset>0x000</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_HFCLKSTART</name>
              <description>Start HFCLK crystal oscillator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_HFCLKSTOP</name>
          <description>Stop HFCLK crystal oscillator</description>
          <addressOffset>0x004</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_HFCLKSTOP</name>
              <description>Stop HFCLK crystal oscillator</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_LFCLKSTART</name>
          <description>Start LFCLK source</description>
          <addressOffset>0x008</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_LFCLKSTART</name>
              <description>Start LFCLK source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TASKS_LFCLKSTOP</name>
          <description>Stop LFCLK source</description>
          <addressOffset>0x00C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>TASKS_LFCLKSTOP</name>
              <description>Stop LFCLK source</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Trigger</name>
                  <description>Trigger task</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_HFCLKSTART</name>
          <description>Subscribe configuration for task HFCLKSTART</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task HFCLKSTART will subscribe to</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_HFCLKSTOP</name>
          <description>Subscribe configuration for task HFCLKSTOP</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task HFCLKSTOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_LFCLKSTART</name>
          <description>Subscribe configuration for task LFCLKSTART</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task LFCLKSTART will subscribe to</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SUBSCRIBE_LFCLKSTOP</name>
          <description>Subscribe configuration for task LFCLKSTOP</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that task LFCLKSTOP will subscribe to</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable subscription</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable subscription</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_HFCLKSTARTED</name>
          <description>HFCLK oscillator started</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_HFCLKSTARTED</name>
              <description>HFCLK oscillator started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTS_LFCLKSTARTED</name>
          <description>LFCLK started</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>EVENTS_LFCLKSTARTED</name>
              <description>LFCLK started</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotGenerated</name>
                  <description>Event not generated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Generated</name>
                  <description>Event generated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_HFCLKSTARTED</name>
          <description>Publish configuration for event HFCLKSTARTED</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that event HFCLKSTARTED will publish to.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PUBLISH_LFCLKSTARTED</name>
          <description>Publish configuration for event LFCLKSTARTED</description>
          <addressOffset>0x184</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>CHIDX</name>
              <description>Channel that event LFCLKSTARTED will publish to.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>EN</name>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable publishing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable publishing</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Enable or disable interrupt</description>
          <addressOffset>0x300</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HFCLKSTARTED</name>
              <description>Enable or disable interrupt for event HFCLKSTARTED</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFCLKSTARTED</name>
              <description>Enable or disable interrupt for event LFCLKSTARTED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Enable interrupt</description>
          <addressOffset>0x304</addressOffset>
          <access>read-write</access>
          <fields>
            <field>
              <name>HFCLKSTARTED</name>
              <description>Write '1' to enable interrupt for event HFCLKSTARTED</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFCLKSTARTED</name>
              <description>Write '1' to enable interrupt for event LFCLKSTARTED</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Read: Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Read: Enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
