zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf9160.svd
          <register>
            <name>RXEN</name>
            <description>Reception (RX) enable.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>RXEN</name>
                <description>Reception (RX) enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Reception disabled and now data will be written to the RXD.PTR address.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Reception enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>TXEN</name>
            <description>Transmission (TX) enable.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>TXEN</name>
                <description>Transmission (TX) enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Transmission disabled and now data will be read from the RXD.TXD address.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Transmission enabled.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKEN</name>
            <description>Master clock generator enable.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>MCKEN</name>
                <description>Master clock generator enable.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Master clock generator disabled and PSEL.MCK not connected(available as GPIO).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Master clock generator running and MCK output on PSEL.MCK.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>MCKFREQ</name>
            <description>Master clock generator frequency.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x20000000</resetValue>
            <fields>
              <field>
                <name>MCKFREQ</name>
                <description>Master clock generator frequency.</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32MDIV8</name>
                    <description>32 MHz / 8 = 4.0 MHz</description>
                    <value>0x20000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV10</name>
                    <description>32 MHz / 10 = 3.2 MHz</description>
                    <value>0x18000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV11</name>
                    <description>32 MHz / 11 = 2.9090909 MHz</description>
                    <value>0x16000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV15</name>
                    <description>32 MHz / 15 = 2.1333333 MHz</description>
                    <value>0x11000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV16</name>
                    <description>32 MHz / 16 = 2.0 MHz</description>
                    <value>0x10000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV21</name>
                    <description>32 MHz / 21 = 1.5238095</description>
                    <value>0x0C000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV23</name>
                    <description>32 MHz / 23 = 1.3913043 MHz</description>
                    <value>0x0B000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV30</name>
                    <description>32 MHz / 30 = 1.0666667 MHz</description>
                    <value>0x08800000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV31</name>
                    <description>32 MHz / 31 = 1.0322581 MHz</description>
                    <value>0x08400000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV32</name>
                    <description>32 MHz / 32 = 1.0 MHz</description>
                    <value>0x08000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV42</name>
                    <description>32 MHz / 42 = 0.7619048 MHz</description>
                    <value>0x06000000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV63</name>
                    <description>32 MHz / 63 = 0.5079365 MHz</description>
                    <value>0x04100000</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32MDIV125</name>
                    <description>32 MHz / 125 = 0.256 MHz</description>
                    <value>0x020C0000</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RATIO</name>
            <description>MCK / LRCK ratio.</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000006</resetValue>
            <fields>
              <field>
                <name>RATIO</name>
                <description>MCK / LRCK ratio.</description>
                <lsb>0</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>32X</name>
                    <description>LRCK = MCK / 32</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>48X</name>
                    <description>LRCK = MCK / 48</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>64X</name>
                    <description>LRCK = MCK / 64</description>
                    <value>2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>96X</name>
                    <description>LRCK = MCK / 96</description>
                    <value>3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>128X</name>
                    <description>LRCK = MCK / 128</description>
                    <value>4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>192X</name>
                    <description>LRCK = MCK / 192</description>
                    <value>5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>256X</name>
                    <description>LRCK = MCK / 256</description>
                    <value>6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>384X</name>
                    <description>LRCK = MCK / 384</description>
                    <value>7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>512X</name>
                    <description>LRCK = MCK / 512</description>
                    <value>8</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SWIDTH</name>
            <description>Sample width.</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <fields>
              <field>
                <name>SWIDTH</name>
                <description>Sample width.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8Bit</name>
                    <description>8 bit.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16Bit</name>
                    <description>16 bit.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>24Bit</name>
                    <description>24 bit.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>ALIGN</name>
            <description>Alignment of sample within a frame.</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>ALIGN</name>
                <description>Alignment of sample within a frame.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Left</name>
                    <description>Left-aligned.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Right</name>
                    <description>Right-aligned.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FORMAT</name>
            <description>Frame format.</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>FORMAT</name>
                <description>Frame format.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>I2S</name>
                    <description>Original I2S format.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Aligned</name>
                    <description>Alternate (left- or right-aligned) format.</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CHANNELS</name>
            <description>Enable channels.</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>CHANNELS</name>
                <description>Enable channels.</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Stereo</name>
                    <description>Stereo.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Left</name>
                    <description>Left only.</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Right</name>
                    <description>Right only.</description>
                    <value>2</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_RXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x538</addressOffset>
          <register>
            <name>PTR</name>
            <description>Receive buffer RAM start address.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Receive buffer Data RAM start address. When receiving, words containing samples will be written to this address. This address is a word aligned Data RAM address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_TXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x540</addressOffset>
          <register>
            <name>PTR</name>
            <description>Transmit buffer RAM start address.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>PTR</name>
                <description>Transmit buffer Data RAM start address. When transmitting, words containing samples will be fetched from this address. This address is a word aligned Data RAM address.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXTXD</name>
          <description>Unspecified</description>
          <headerStructName>I2S_RXTXD</headerStructName>
          <access>read-write</access>
          <addressOffset>0x550</addressOffset>
          <register>
            <name>MAXCNT</name>
            <description>Size of RXD and TXD buffers.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Size of RXD and TXD buffers in number of 32 bit words.</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PSEL</name>
          <description>Unspecified</description>
          <headerStructName>I2S_PSEL</headerStructName>
          <access>read-write</access>
          <addressOffset>0x560</addressOffset>
          <register>
            <name>MCK</name>
            <description>Pin select for MCK signal.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SCK</name>
            <description>Pin select for SCK signal.</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>LRCK</name>
            <description>Pin select for LRCK signal.</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDIN</name>
            <description>Pin select for SDIN signal.</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>SDOUT</name>
            <description>Pin select for SDOUT signal.</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <fields>
              <field>
                <name>PIN</name>
                <description>Pin number</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>CONNECT</name>
                <description>Connection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disconnected</name>
                    <description>Disconnect</description>
                    <value>1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Connected</name>
                    <description>Connect</description>
                    <value>0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
