zephyrproject-rtos/zephyr/ext/hal/nordic/nrfx/mdk/nrf9160.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMC_NS</name>
      <description>Non-volatile memory controller 0</description>
      <baseAddress>0x40039000</baseAddress>
      <alternatePeripheral>KMU_NS</alternatePeripheral>
      <headerStructName>NVMC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=SPLIT-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>NVMC</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>READY</name>
          <description>Ready flag</description>
          <addressOffset>0x400</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <!--Security securemapping=NS-->
          <fields>
            <field>
              <name>READY</name>
              <description>NVMC is ready or busy</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC is busy (on-going write or erase operation)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>READYNEXT</name>
          <description>Ready flag</description>
          <addressOffset>0x408</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <!--Security securemapping=NS-->
          <fields>
            <field>
              <name>READYNEXT</name>
              <description>NVMC can accept a new write operation</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Busy</name>
                  <description>NVMC cannot accept any write operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ready</name>
                  <description>NVMC is ready</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIG</name>
          <description>Configuration register</description>
          <addressOffset>0x504</addressOffset>
          <access>read-write</access>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>WEN</name>
              <description>Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated.</description>
              <lsb>0</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEen</name>
                  <description>Partial erase enabled</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEALL</name>
          <description>Register for erasing all non-volatile user memory</description>
          <addressOffset>0x50C</addressOffset>
          <access>read-write</access>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>ERASEALL</name>
              <description>Erase all non-volatile memory including UICR registers. Note that erasing must be enabled by setting CONFIG.WEN = Een before the non-volatile memory can be erased.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NoOperation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Erase</name>
                  <description>Start chip erase</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ERASEPAGEPARTIALCFG</name>
          <description>Register for partial erase configuration</description>
          <addressOffset>0x51C</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000A</resetValue>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>DURATION</name>
              <description>Duration of the partial erase in milliseconds</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ICACHECNF</name>
          <description>I-code cache configuration register</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>CACHEEN</name>
              <description>Cache enable</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache. Invalidates all cache entries.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEPROFEN</name>
              <description>Cache profiling enable</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable cache profiling</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable cache profiling</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IHIT</name>
          <description>I-code cache hit counter</description>
          <addressOffset>0x548</addressOffset>
          <access>read-write</access>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>HITS</name>
              <description>Number of cache hits</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IMISS</name>
          <description>I-code cache miss counter</description>
          <addressOffset>0x54C</addressOffset>
          <access>read-write</access>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>MISSES</name>
              <description>Number of cache misses</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CONFIGNS</name>
          <description>Unspecified</description>
          <addressOffset>0x584</addressOffset>
          <access>read-write</access>
          <!--Security securemapping=NS-->
          <fields>
            <field>
              <name>WEN</name>
              <description>Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated.</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Ren</name>
                  <description>Read only access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Wen</name>
                  <description>Write enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Een</name>
                  <description>Erase enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WRITEUICRNS</name>
          <description>Non-secure APPROTECT enable register</description>
          <addressOffset>0x588</addressOffset>
          <access>write-only</access>
          <!--Security securemapping=NS-->
          <fields>
            <field>
              <name>SET</name>
              <description>Allow non-secure code to set APPROTECT</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set value</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>Key to write in order to validate the write operation</description>
              <lsb>4</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Keyvalid</name>
                  <description>Key value</description>
                  <value>0xAFBE5A7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEONNVM</name>
          <description>Force on all NVM supplies. Also see the internal section in the NVMC chapter.</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>FORCEONNVM</name>
              <description>Force on all NVM supplies. Also see the internal section in the NVMC chapter.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOn</name>
                  <description>Do not force on NVM supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOn</name>
                  <description>Force on NVM supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCEOFFNVM</name>
          <description>Force off NVM supply. Also see the internal section in the NVMC chapter.</description>
          <addressOffset>0x728</addressOffset>
          <access>read-write</access>
          <!--Security securemapping=S-->
          <fields>
            <field>
              <name>FORCEOFFNVM0</name>
              <description>Force off NVM supply 0. Also see the internal section in the NVMC chapter.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOff</name>
                  <description>Do not force off supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOff</name>
                  <description>Force off supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEOFFNVM1</name>
              <description>Force off NVM supply 1. Also see the internal section in the NVMC chapter.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DoNotForceOff</name>
                  <description>Do not force off supply</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ForceOff</name>
                  <description>Force off supply</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY</name>
              <description>KEY</description>
              <lsb>8</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>write</usage>
                <enumeratedValue>
                  <name>EnableWrite</name>
                  <description>Must be written in order to write to bits 0-7. Any other value will ignore writes to this register. Read as zero.</description>
                  <value>0xACCE55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
